app/controllers/sentence_controller.rb

SELECT "sentences".* FROM "sentences" LIMIT 1 OFFSET 0
SELECT COUNT(*) FROM "sentences"
---
  def index
  	@sentence = Sentence.first(:offset => rand(Sentence.count))

SELECT "sentences".* FROM "sentences" ORDER BY sentence.name ASC
SELECT COUNT(*) FROM "sentences"
---
  def next
  	@sentence = Sentence.first(:offset => rand(Sentence.count))